; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	thermograph1 - mode
	spectrograph4 - mode
	image2 - mode
	infrared3 - mode
	spectrograph0 - mode
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	GroundStation9 - direction
	GroundStation0 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Star16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 spectrograph4)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared3)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star3)
)
(:goal (and
	(have_image Planet10 spectrograph4)
	(have_image Phenomenon11 infrared3)
	(have_image Star12 image2)
	(have_image Phenomenon13 image2)
	(have_image Planet14 thermograph1)
	(have_image Star15 spectrograph0)
	(have_image Star16 infrared3)
	(have_image Planet17 image2)
))

)

; plan
1. (turn_to satellite0 groundstation0 star3)
   deleted: (pointing satellite0 star3)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 8
3. (calibrate satellite0 instrument0 groundstation0)
   added: (calibrated instrument0)
   goals met: 0 of 8
4. (turn_to satellite0 planet14 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 planet14)
   goals met: 0 of 8
5. (take_image satellite0 planet14 instrument0 thermograph1)
   added: (have_image planet14 thermograph1)
   goals met: 1 of 8
6. (turn_to satellite0 planet10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet10)
   goals met: 1 of 8
7. (take_image satellite0 planet10 instrument0 spectrograph4)
   added: (have_image planet10 spectrograph4)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon13 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon13 instrument0 image2)
   added: (have_image phenomenon13 image2)
   goals met: 3 of 8
10. (turn_to satellite0 phenomenon11 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon11)
   goals met: 3 of 8
11. (take_image satellite0 phenomenon11 instrument0 infrared3)
   added: (have_image phenomenon11 infrared3)
   goals met: 4 of 8
12. (turn_to satellite0 planet17 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet17)
   goals met: 4 of 8
13. (take_image satellite0 planet17 instrument0 image2)
   added: (have_image planet17 image2)
   goals met: 5 of 8
14. (turn_to satellite0 star12 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star12)
   goals met: 5 of 8
15. (take_image satellite0 star12 instrument0 image2)
   added: (have_image star12 image2)
   goals met: 6 of 8
16. (turn_to satellite0 star15 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star15)
   goals met: 6 of 8
17. (take_image satellite0 star15 instrument0 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 7 of 8
18. (turn_to satellite0 star16 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star16)
   goals met: 7 of 8
19. (take_image satellite0 star16 instrument0 infrared3)
   added: (have_image star16 infrared3)
   goals met: 8 of 8
